{
	"languages": {
		"fr": {
			"strings": {
				"a-propos"									: "A propos",
				"jeux"										: "Jeux",
				"projets-divers"							: "Projets divers",
				"contact"									: "Contact",
				"bonjour"									: "Bonjour!",
				"a-propos-p1"								: "Je suis <lead class=\"h2\">Oscar Trosseau</lead>, <strong>étudiant en école d'ingénieur</strong> faisant un double diplôme <strong>d'informatique pour le jeu vidéo</strong>.",
				"a-propos-p2"								: "Je souhaite continuer dans cette voie qui me <strong>passionne</strong>, et c'est pour cela que je cherche à effectuer mon <strong>stage de fin d'études</strong> dans le domaine du jeu vidéo, pour une période de <strong>20 à 24 semaines</strong>.",
				"me-contacter"								: "<i class=\"fas fa-paper-plane\"></i> Me contacter",
				"telecharger-cv"							: "<i class=\"fas fa-file-download\"></i> Télécharger mon CV",
				"troubatechno-titre-carousel"				: "Troubatechno: Sauveteur de la House",
				"troubatechno-description-carousel"			: "Sauvez le monde dans ce jeu d'aventure musical, réalisé durant mon master en Informatique à l'Université du Québec à Chicoutimi.",
				"accedez-page"								: "Accédez à la page",
				"CTK-titre-carousel"						: "Crush the King",
				"CTK-description-carousel"					: "Réalisé durant la Wonderjam d'hiver 2021, ce jeu d'arcade oppose deux joueurs dans un duel mêlant tetris et platformer.",
				"space-escaper-titre-carousel"				: "Space Escapers",
				"space-escaper-description-carousel"		: "Utilisez les compétences complémentaires de deux personnages pour vous échapper d'un vaisseau spatial en perdition. Jeu réalisé durant la Global Game Jam 2020.",
				"daltonizator-titre-carousel"				: "Daltonizator",
				"daltonizator-description-carousel"			: "Réalisée dans le cadre du cours de CAI à l'Ecole Nationale d'Ingénieurs de Brest, Daltonizator est une application android ayant pour but de simuler la vision d'un daltonien.",
				"projet-labo-titre-carousel"				: "Projet en laboratoire",
				"projet-labo-description-carousel"			: "Un projet ayant été réalisé sous la supervision d'un enseignant-chercheur durant 4 mois au Centre Européen de la Réalité Virtuelle à Brest. Il m'a permis de travailler sur de la capture de mouvements, de l'animation, de la réalité virtuelle, de la reconnaissance de mouvement et de l'intelligence artificielle.",
				"ia-titre-carousel"							: "Intelligence artificielle",
				"ia-description-carousel"					: "Divers projets réalisés à l'Université du Québec à Chicoutimi, portants sur l'IA.",
				"mon-profil-github"							: "Mon profil Github",
				"CTK-titre"									: "Crush The King",
				"CTK-img1-desc"								: "L'écran titre",
				"CTK-img2-desc"								: "Un joueur...",
				"CTK-img3-desc"								: "... contre un autre.",
				"CTK-img4-desc"								: "Une vue du jeu",
				"CTK-presentation-p1"						: "<strong>Crush The King</strong> est un jeu réalisé durant la WonderJam d'Hiver 2021, dans lequel deux joueurs s'affrontent pour faire le meilleur score. Le premier contrôle un Roi, qui devra survivre le plus longtemps possible et monter le plus haut. Le second contrôlera des blocs à la manière de Tetris, et devra écraser l'autre joueur. Mais attention, car certains blocs spéciaux viendront pimenter la partie...",
				"CTK-presentation-p2"						: "Le jeu a été réalisé avec les contraintes de style suivantes: Platformer, Arcade et Tabletop.",
				"voir-sur-itchio"							: "<i class=\"fab fa-itch-io\"></i> Voir sur itch.io",
				"voir-sur-github"							: "<i class=\"fab fa-github\"></i> Voir sur github",
				"taches-realisees"							: "Taches réalisées",
				"CTK-tR-p1"									: "Durant la game jam, j'ai eu pour tache de m'occuper de l'interface, d'animations ainsi que du système de score. L'une des grosses difficultés était de gérer l'agencement de l'interface pour qu'elle reste cohérente sur différentes résolutions d'écran. De plus, celle-ci devait s'animer suivant les actions qu'effectuait le joueur, et là encore, il fallait faire attention aux différentes résolutions.",
				"CTK-tR-p2"									: "Ayant récupéré des ressources gratuites sur itchio, nous avons pu rapidement obtenir un visuel et des animations de qualité. Enfin, le système de score a dû être ajusté entre les deux types de gameplay afin que les scores soient équivalents.",
				"retour-dXP"								: "Retour d'expérience",
				"CTK-retour-dXp"							: "Cette game jam à constitué un bon entraînement sur Unity, et m'a permise d'apprendre de nombreuses choses au contact de mes camarades. Néanmoins, elle s'est déroulée à distance à cause du covid, et la communication dans l'équipe s'en est retrouvée affectée. Cela m'a permis de prendre toute la conscience de la valeur des discussions en présence et du contact humain lors des différentes phases d'un projet, surtout avec une équipe de taille moyenne.",
				"fiche-technique"							: "Fiche technique",
				"outils"									: "<i class=\"fas fa-tools\"></i> Outils",
				"equipe"									: "<i class=\"fas fa-users\"></i> Equipe",
				"annee"										: "<i class=\"far fa-calendar-alt\"></i> Année",
				"dalto-titre"								: "Daltonizator",
				"dalto-img1-desc"							: "L'écran d'acceuil de l'application",
				"dalto-img2-desc"							: "Les différentes étapes permettant d'utiliser l'application.",
				"dalto-presentation-p1"						: "<strong>Daltonizator</strong> est une application android réalisée dans le cadre du cours de Conception d'Applications Interactives à l'ENIB. Elle à pour but de permettre de simuler rapidement la vision d'un daltonien.",
				"dalto-presentation-p2"						: "Dans le cadre de ce projet, nous devions mettre en place les notions abordées lors du cours sur le développement android. De plus, nous avions comme thème les <a href=\"https://www.un.org/sustainabledevelopment/fr/objectifs-de-developpement-durable/\">objectifs du développement durable</a>. Avec mon équipe, nous avons donc décidé de nous pencher sur l'objectif n°10, à savoir la réduction des inégalités.",
				"dalto-presentation-p3"						: "Nous avons réalisé ce projet avec en tête l'idée que tout développeur pourrait facilement et rapidement tester l'accessibilité de son application ou de son site.",
				"dalto-tR-p1"								: "Le projet ayant été développé en un temps assez court et dans une équipe de 2, j'ai pu travailler sur toutes les parties de l'application.",
				"dalto-tR-p2"								: "Nous avons pu avancer rapidement sur la réalisation de l'application, avec les différentes vues. Le cœur du projet a été la manipulation d'image, et nous avons dû rechercher longtemps avant de trouver la bonne manière de transformer les couleurs des images. Nous avons finalement utilisé des matrices de transformation des couleurs, normalement destinées à des logiciels de retouche d'image comme Photoshop ou Gimp.",
				"dalto-retour-dXp"							: "Ce projet m'a permis de me familiariser avec Android Studio, et d'apprendre les bases du développement mobile. Qui plus-est, cela a pu me sensibiliser aux problématiques liées au daltonisme. J'ai pris conscience de l'importance des choix de couleurs dans la construction d'un site web ou d'un jeu, et de la nécessité d'avoir de bons contrastes. Faire attention à ces éléments de design est une bonne pratique, qui n'est pas utile qu'aux daltoniens.",
				"ia-titre"									: "Intelligence Artificielle",
				"ia-presentation-p1"						: "<strong>Le domaine de l'intelligence artificielle</strong> m'intéresse fortement, aussi ai-je suivi plusieurs cours traitants du sujet. Le premier se concentrait sur des problèmes d'intelligence artificielle généraux, et le second traitait de problèmes spécifiques aux jeux vidéo. Ces cours fonctionnaient avec un système de projet en groupe, aussi cela m'a permis de mettre en oeuvre concrètement ce que j'y ai appris.",
				"ia-cours-ia"								: "Cours IA",
				"ia-cours-ia-p1"							: "Dans ce cours, réalisé à l'UQAC et encadré par C. Cousyn, trois petits projets ont permis de mettre en place les différentes notions abordées en cours. Une des notions centrales était le concept d'agent, mais d'autres notions tel que les systèmes-experts ont été abordées.",
				"ia-cours-ia-p2"							: "Le but de ce projet était de créer un agent aspirateur, qui se déplacerait automatiquement pour nettoyer la poussière. Cela se ferait dans un quadrillage, avec chaque case représentant une pièce. Des poussières ou des bijoux pouvaient apparaitre de façon asynchrone sur le quadrillage, et l'agent devait réagir en conséquence: aspirer la poussière, récupérer les bijoux. Il devait aussi le faire en minimisant ses déplacements.",
				"ia-cours-ia-p3"							: "Ce projet s'appuyait sur les notions d'agent de type \"basé sur des buts\", ainsi qu'un système de BDI, \"Beliefs-Desires-Intentions\". Enfin, il s'appuyait aussi sur des algorithmes d'exploration non-informée.",
				"ia-cours-ia-p4"							: "Ce projet avait pour but de créer un algorithme capable de résoudre un sudoku. Ici on a utilisé ce que nous avions appris sur les problèmes à satisfaction de contrainte, et par extension l'exploration informée.",
				"ia-cours-ia-p5"							: "Dans ce projet, un agent logique se retrouve perdu dans une forêt, représentée par une grille de cases. Il doit s'en échapper, en évitant un certain nombre d'obstacles, tels que des monstres ou des crevasse. Cet agent peut se déplacer et lancer des pierres pour se débarrasser des monstres.",
				"ia-cours-ia-p6"							: "Là encore, on utilise la modélisation agent, mais avec un formalisme logique similaire à celui des systèmes experts. De plus, des notions probabilistes sont intégrées afin de calculer les risques de telle ou telle action.",
				"ia-cours-ia-p7"							: "À la fin de la session, il nous était demandé de réaliser un projet, en s'appuyant la technologie d'IA de notre choix, pour répondre à une problématique.",
				"ia-cours-ia-p8"							: "Dans notre groupe, nous n'étions que des français, et nous nous sommes rendu compte que nous avions beaucoup de difficultés à reconnaitre les marques de voiture du Québec. Nous avons donc décidé de mettre en place une application qui permettrait, à partir d'une photo, d'identifier la marque d'une voiture.",
				"ia-cours-ia-p9"							: "Pour cela, nous avons fait appel à des notions d'apprentissage machine, et avons mis en place un réseau de neurones convolutifs sur Google Collaboratory avec des résultats concluants.",
				"ia-cours-ia-agent-aspi"					: "Agent aspirateur",
				"ia-img1-desc"								: "Une vue du projet agent aspirateur",
				"ia-img2-desc"								: "Une vue du projet solveur de sudoku",
				"ia-img3-desc"								: "Une vue du projet agent logique",
				"ia-img4-desc"								: "Une vue du projet de session",
				"ia-cours-ia-sudoku"						: "Solveur de Sudoku",
				"ia-cours-ia-agent-logique"					: "Agent logique",
				"ia-cours-projet-session"					: "Projet de session",
				"ia-cours-iaJV"								: "Cours d'IA pour le Jeu Vidéo",
				"ia-cours-iaJV-p1"							: "Ce cours, réalisé lui aussi à l'UQAC, encadré par A. Bouzane, aborde le sujet de l'intelligence artificielle en se concentrant sur son utilisation dans les jeux vidéo. Pour cela, le livre \"Programming Game AI by Example\" de M. Buckland a servi de support.",
				"ia-cours-iaJV-p2"							: "Nous avons travaillé dans un premier temps à la mise en place de la machine à état fini d'agents PNJ, en utilisant un système de communication à haut niveau à base de messages.",
				"ia-cours-iaJV-p3"							: "Par la suite, nous avons travaillé sur la programmation de comportement émergent, avec par exemple des algorithmes de flocking.",
				"ia-cours-iaJV-p4"							: "Enfin, nous avons eu un projet de session qui demandait de réutiliser tout ce que nous avions appris en cours.",
				"ia-cours-iaJV-p5"							: "Nous avons du adapter le code source d'un jeu du livre de M. Buckland, le jeu \"Raven\". Il s'agit d'un jeu de type Quake ou Unreal Tournament, dans lequel des agents s'entretuent. Ceux-ci peuvent choisir entre une variété d'armes, et peuvent récupérer des munitions et des trousses de soin.",
				"ia-cours-iaJV-p6"							: "Il nous était demandé de rajouter des règles pour le choix de certaines actions, d'implémenter un comportement flou, de rajouter un système d'équipes et d'ordres donnés par le joueur. Enfin, nous devions aussi rajouter un agent apprenant, grace à de l'apprentissage machine.",
				"ia-cours-iaJV-p7"							: "Ce projet m'a permis d'apprendre énormément de choses sur l'intelligence artificielle, et son implémentation dans un jeu.",
				"ia-ds-le-1er-cours"						: "dans le premier cours:",
				"ia-ds-le-2nd-cours"						: "puis dans le second cours:",
				"projet-lab-titre"							: "Projet en laboratoire",
				"projet-lab-img1-desc"						: "Le CERV",
				"projet-lab-img2-desc"						: "La tenue Perception Neuron",
				"projet-lab-img3-desc"						: "La caisse contenant le matériel de VR",
				"projet-lab-img4-desc"						: "Une vue de l'application sur Unity",
				"projet-lab-presentation-p1"				: "<strong>Ce projet en laboratoire</strong> a été réalisé en partenariat avec l'Ecole Nationale d'Ingénieurs de Brest au Centre Européen de la Réalité Virtuelle. Encadré par deux enseignants-chercheurs, le sujet était: \"utilisation d'un dispositif mobile de captation de mouvements et la manipulation d'un bras à retour d'efforts.\". Cela s'est déroulé sur 4 mois entre septembre et décembre 2020.",
				"projet-lab-presentation-p2"				: "Suite au confinement durant cette période, les objectifs ont évolué. Le projet final a consisté à mettre en œuvre des algorithmes de reconnaissance de gestes et d'analyse d'activités à partir de données de squelette 3D et de les intégrer dans un environnement de réalité virtuelle sous Unity.",
				"projet-lab-presentation-p3"				: "Pour mener à bien cette mission, moi et mon binôme avons dû nous appuyer sur des articles scientifiques et comparer différents algorithmes et configuration. Cela nous a permis d'aborder de nombreux domaines, d'utiliser des technologies pour la première fois, et tout cela grace à la confiance que nous ont accordé nos encadrant; <a href=\"https://www.enib.fr/~nedelec/\">A. Nedelec</a> et <a href=\"https://www.enib.fr/~querrec/\">R. Querrec</a>",
				"voir-doc"									: "<i class=\"fas fa-book\"></i> Voir la documentation",
				"projet-lab-mocap"							: "Capture de mouvements",
				"projet-lab-mocap-p1"						: "Le CERV avait à sa disposition plusieurs tenues de Motion Capture, avec des technologies différentes. Nos encadrant nous ont alors proposé d'utiliser la tenue Perception Neuron, de la compagnie Noitom, qu'ils venaient tout juste de recevoir. C'est une tenue portable, adaptative et peu coûteuse, qui fonctionne avec des capteurs magnétiques. De plus, la compagnie Noitom a développé des modules pour qu'elle puisse fonctionner en temps réel avec différents logiciels, que ce soit Unity, Unreal Engine ou des logiciels de modélisation comme Blender ou Maya.",
				"projet-lab-mocap-p2"						: "Nous avons donc pu relier la tenue avec une application, réalisée sur Unity, qui permettait la gestion de ces données.",
				"projet-lab-rv"								: "Réalité Virtuelle",
				"projet-lab-rv-p1"							: "Encore une fois, le CERV nous a permis d'accéder à son matériel. Nous avons donc pu travailler avec un HTC Vive, dans une salle qui avait été mise à notre disposition.",
				"projet-lab-rv-p2"							: "Nous avons ensuite dû synchroniser le casque et la tenue sur Unity, ce qui nous donné une très bonne base pour travailler sur le coeur du projet.",
				"projet-lab-reco-mvt"						: "Reconnaissance de mouvements",
				"projet-lab-reco-mvt-p1"					: "La partie qui a demandé le plus de temps sur ce projet était la reconnaissance de mouvements. En effet, c'est un sujet de recherche qui nécessite encore beaucoup de travail. Nous avons utilisé deux approches différentes: l'étude des variations, puis l'apprentissage machine.",
				"projet-lab-reco-mvt-p2"					: "La première approche se divise en deux étapes: dans un premier temps, de la reconnaissance de position, puis dans un second temps de la reconnaissance de mouvement dans un flux de positions. Cette approche, plutot simpliste, ne donne pas de très bons résultats.",
				"projet-lab-reco-mvt-p3"					: "La seconde approche, l'apprentissage machine, a donné de bien meilleurs résultats, tout en offrant des temps de calculs plus courts.",
				"projet-lab-reco-mvt-p4"					: "Dans les deux cas, nous nous sommes appuyé sur des articles scientifiques, et avons intégré le tout dans une application d'entrainement au mouvement et de reconnaissance de mouvement.",
				"troubatechno-titre1"						: "Troubatechno",
				"troubatechno-titre2"						: "Sauveteur de la House",
				"troubatechno-img1-desc"					: "Le Voyageur",
				"troubatechno-img2-desc"					: "Les déplacements du voyageur",
				"troubatechno-img3-desc"					: "Les interactions avec les objets",
				"troubatechno-img4-desc"					: "Le jeu de rythme",
				"troubatechno-img5-desc"					: "Une vue du projet sous Unreal",
				"troubatechno-presentation-p1"				: "Réalisé dans le cadre du cours 8INF962 \"Laboratoire de jeux vidéo\" de l'UQAC, Troubatechno vous permet d'incarner un voyageur temporel célèbre dans toute la galaxie, coupable d'évasion fiscale.",
				"troubatechno-presentation-p2"				: "Désormais contraint de partir en cavale, vous vous réfugiez sur une planète presque inhabitée... Si ce n'est par un dieu colérique! Vous devrez alors découvrir comment le vaincre en voyageant dans le temps. Utiliserez-vous votre spacio-luth pour le calmer ou le détruire?",
				"troubatechno-presentation-p3"				: "Pour mener à bien votre mission, vous devrez:",
				"troubatechno-presentation-liste"			: "<li>Voyager dans le temps</li><li>Combattre les sbires du dieu</li><li>Esquiver ses attaques dévastatrices</li><li>Trouver ses points faibles</li><li>... et jouer de la musique!</li>",
				"troubatechno-tR-p1"						: "Dans le cadre de ce projet, j'ai dû m'occuper de mettre en place les déplacements du joueur et leurs animations. J'ai ensuite mis en place un système d'interactions avec différents objets et des retour visuels.",
				"troubatechno-tR-p2"						: "J'ai aussi fait du level design en m'occupant d'une des zones du jeu. Enfin, j'ai réalisé tout le jeu de rythme, que ce soit l'interface, les animations ou la synchronisation du jeu avec la musique.",
				"troubatechno-retour-dXP-p1"				: "Ce projet m'a permis d'en apprendre beaucoup sur le développement de jeux vidéo. J'ai pu mettre en pratique ce qui m'a été enseigné sur les méthodes agiles. J'ai aussi pu apprendre à me servir d'Unreal Engine, en me servant à la fois du C++ et des blueprints.",
				"troubatechno-retour-dXP-p2"				: "Plus que des compétences purement techniques, ce projet m'a aussi permis de me pencher sur de l'animation, du sound design, du level design et de l'équilibrage. La taille restreinte de l'équipe m'a permise de me confronter au moins un petit peu à chaque aspects du développement, et cela à été une expérience passionnante.",
				"space-escaper-titre"						: "Space Escapers",
				"space-escaper-img1-desc"					: "L'écran titre",
				"space-escaper-img2-desc"					: "L'introduction",
				"space-escaper-img3-desc"					: "Le scientifique",
				"space-escaper-img4-desc"					: "Le mécanicien",
				"space-escaper-img5-desc"					: "Le système d'interaction",
				"space-escaper-img6-desc"					: "Une des énigmes",
				"space-escaper-presentation-p1"				: "<strong>Space Escapers</strong> est un jeu réalisé durant la Global Game Jam 2020, dans lequel vous devez aider deux occupants d'un vaisseau spatial en perdition à s'échapper. Le mécanicien et le scientifique ont tout deux des compétences spécifiques, et ils devront travailler ensemble s'ils veulent réussir! Ils disposent tout de même d'un outil précieux, qui leur permet d'échanger leurs positions. Résolvez les énigmes qui leur barre le chemin de la sortie!",
				"space-escaper-presentation-p2"				: "Le thème de cette édition était \"Repair\".",
				"space-escaper-tR-p1"						: "Durant la game jam, j'ai eu pour tache de créer le système d'interaction avec l'environnement. Je me suis aussi occupé de différents éléments du jeu, tels que les téléporteurs ou les portes. Enfin, j'ai aussi réalisé une des énigmes.",
				"space-escaper-retour-dXP-p1"				: "C'était ma première Game Jam, et elle à été très enrichissante et ludique. Cela m'a permis de découvrir plusieurs outils sur Unity, et d'apprendre à travailler sous la pression.",
				"space-escaper-retour-dXP-p2"				: "Elle m'a aussi permis de réaliser que je souhaitais vraiment continuer dans le domaine du jeu vidéo. En effet, plus encore que le plaisir qu'apporte le fait de résoudre un problème, c'est la créativité que je pouvais déployer qui me motive vraiment dans le domaine de l'informatique.",
				"voir-sur-GGJ"								: "Voir sur le site de la Global Game Jam",
				"ratvage-titre-carousel"					: "Ratvage",
				"ratvage-description-carousel" 				: "Faites grossir votre horde de rats et prenez le contrôle d'une ile de pirates.",
				"ratvage-titre" 							: "Ratvage",
				"ratvage-img1-desc" 						: "Le rat",
				"ratvage-img2-desc" 						: "Du fromage",
				"ratvage-img3-desc" 						: "Un pirate",
				"ratvage-img4-desc" 						: "Des ordures",
				"ratvage-img5-desc" 						: "La vue d'un des niveaux que j'ai développé",
				"ratvage-img6-desc" 						: "La horde qui suit le rat principal",
				"ratvage-img7-desc" 						: "Le menu de choix de niveau",
				"ratvage-presentation-p1"					: "Dans Ratvage, vous incarnez un rat désabusé par la vie sur le vieux continent, qui cherche à trouver sa place dans le nouveau monde. Il sera <strong>roi</strong>, rien de moins!",
				"ratvage-presentation-p2"					: "Pour aller au bout de ses ambitions, il pourra compter sur sa fidèle horde de rats. Celle-ci grossira à chaque fromage qu'il mangera. Et il en aura besoin, car de féroces pirates habitent son futur royaume, et seul le nombre pourra les vaincre.",
				"ratvage-presentation-p3"					: "Attention, car il n'a pas un contrôle absolu sur la horde; tous les rats aiment la nourriture, mais ils sont encore plus attirés par les ordures.",
				"ratvage-presentation-p4"					: "Si vous l'aidez à braver tous les dangers, alors vous aurez la chance de récupérer le Graal des fromages, et ainsi asseoir votre contrôle sur la région.",
				"ratvage-presentation-p5"					: "Ce jeu a été réalisé dans le cadre du cours 8INF960 \"Principes de conception et de développement de jeux vidéo\" de l'UQAC.",
				"ratvage-tR-p1" 							: "Dans ce projet, j'étais le seul à avoir des expériences de développement de jeu vidéo, que ce soit dans des gamejam ou avec les cours de l'UQAC. Cela m'a permis d'avoir un rôle de conseil et de supervision plus important que dans mes projets précédents. J'ai entre autres été scrum-master.",
				"ratvage-tR-p2" 							: "Autrement, j'ai pu me confronter à des aspects du développement de jeu vidéo que je n'avais pas abordé: j'ai fait du level design, sur 3 niveaux différents. J'ai pu aussi faire de l'IA, en m'occupant du comportement de la horde de rats: j'ai implémenté un <a href=\"https://github.com/SebLague/Boids\" target=\"_blank\">système de flocking</a> développé par Seb Lague, que j'ai modifié suivant les besoins du projet.",
				"ratvage-tR-p3"  							: "Je me suis aussi occupé des déchets, et de la façon dont ils interagissent avec la horde. J'ai implémenté un menu de choix de niveau, que j'ai voulu rendre très dynamique et fun à regarder. Enfin, j'ai passé énormément de temps à faire du polish et des bugfixes.",
				"ratvage-retour-dXP-p1" 					: "J’ai énormément appris durant ce projet, et j’ai le sentiment d’avoir évolué depuis mon premier projet en Laboratoire Jeu Vidéo à l'UQAC. J’ai pu aborder de nouveaux domaines, tels que le level design, l’IA, de l’animation.",
				"ratvage-retour-dXP-p2" 					: "Travailler avec mes camarades a été un plaisir, la communication était bonne et nous avancions de manière constante. J’en suis d’autant plus heureux que c’était la première expérience que mes camarades avaient avec ce genre de projet. Je suis très content du résultat final, même si le jeu est court, il ne donne pas l'impression d’avoir été bâclé, grâce notamment aux feedbacks et au polish.",
				"koompsC-titre-carousel" 					: "Koomp’s Ca$hette",
				"koompsC-description-carousel" 				: "Amassez le plus de pièces ou chassez vos amis dans ce jeu de cache-cache en réseau, réalisé dans le cadre du cours \"Programmation réseau dans les jeux vidéos\" à l'UQAC.",
				"koompsC-titre"			 					: "Koomp’s Ca$hette",
				"koompsC-img1-desc"		 					: "Le Cosht",
				"koompsC-img2-desc"		 					: "Un Koomps",
				"koompsC-img3-desc"		 					: "Un Koomps se fait poursuivre",
				"koompsC-img4-desc"		 					: "La carte du jeu",
				"koompsC-img5-desc"		 					: "Une pièce à récupérer",
				"koompsC-img6-desc"		 					: "Le point de vue du Cosht",
				"koompsC-img7-desc"		 					: "L'écran de fin de partie",
				"koompsC-presentation-p1" 					: "Koomp’s Ca$hette est un jeu de cache-cache avec un design cartoon où plusieurs joueurs vont se cacher d’un dernier joueur, tout en cherchant des pièces disséminées dans le niveau. L’objectif est d’être le joueur ayant amassé le plus de pièces à la fin du temps donné.",
				"koompsC-presentation-p2" 					: "Les joueurs jouant les Koomps (c-à-d les proies) peuvent se déplacer, se cacher, et récolter des pièces. Le joueur jouant le Cosht (c-à-d le chasseur) peut se déplacer, et envoyer un rayon laser sur les proies. Cela leur retire alors des pièces, et les téléportent loin de lui.",
				"koompsC-presentation-p3" 					: "Ce projet a été réalisé dans le cadre du cours \"Programmation réseau dans les jeux vidéos\" à l'UQAC.",
				"koompsC-tR-p1" 							: "Dans ce projet, nous avons tout d'abord cherché à avoir un premier prototype simple du jeu, sans mise en réseau. Je me suis occupé des pièces, et de leur apparition sur la carte. Mes camarades ont eu rajouté les Koomps et l'interface.",
				"koompsC-tR-p2" 							: "Dans un second temps, je me suis occupé de mettre en réseau ce prototype, pendant que mes camarades continuaient le développement du prototype. J'ai aussi rajouté un menu basique, afin de pouvoir se connecter à différentes adresses. Mes camarades ayant avancé sur leurs parties, j'ai pu mettre les mettre en réseau aussi, notamment le Cosht.",
				"koompsC-tR-p3" 							: "Nous avions alors un prototype presque achevé, j'ai donc fini de réaliser la boucle de jeu (l'apparition à un point aléatoire des joueurs, le compte à rebours, l'écran de victoire final...). Sur le peu de temps qu'il restait, je me suis occupé de fixer des bugs et de faire du polish.",
				"koompsC-retour-dXP-p1" 					: "J'avais déjà abordé le réseau dans mes études, mais de manière assez superficielle. Le cours de \"Programmation réseau dans les jeux vidéos\" m'a permis d'approfondir et de mettre en pratique ces connaissances. Dans un premier temps de manière générale (nous devions réaliser des bibliothèques permettant de faire du réseau, avec Socket/Serialisation/Replication), puis plus précisément avec la solution offerte par Unity.",
				"koompsC-retour-dXP-p2" 					: "Et malgré la taille modérée de ce projet, j'ai beaucoup appris sur les problématiques du réseau dans les jeux vidéos. De plus, en jouant avec mes camarades, j'ai réalisé qu'il était plus facile de rendre les jeux multijoueur amusant que les jeux en solo. En effet, même avec son gameplay très simple le jeu est fun.",
				"moteur-physique-titre-carousel" 			: "Moteur physique rudimentaire",
				"moteur-physique-description-carousel" 		: "Un moteur physique réalisé durant le cours de \"Mathématiques et Physique pour le jeu Vidéo\" de l'UQAC, s'appuyant sur OpenGL et ImGui pour le rendu.",
				"moteur-physique-titre"						: "Moteur Physique",
				"moteur-physique-presentation-p1"			: "Dans le cadre du cours \"Mathématique et Phyisique pour le jeu vidéo\" de l'UQAC, j'ai avec deux camarades programmé un moteur physique rudimentaire. Nous nous sommes appuyé en particulier sur deux livres, \"Game Physics Engine Development\" de I. Millington et \"Real time collision detection\" de C. Ericson.",
				"moteur-physique-presentation-p2"			: "Nous avons dans un premier temps développé un système de particule, avec un moteur physique qui pouvait simuler plusieurs types de forces (gravité, liaison élastique, flottaison...) et gérer les collisions. Dans un second temps, nous avons développé un système de rigidbody: contrairement aux particules qui ont un volume nul, les rigidbody ont une forme, un volume et donc aussi une masse. De plus, les rotations doivent être prises en compte. Finalement, nous avons programmé un système de détection de collision pour ces rigidbody, sans la résolution qui était hors programme.",
				"moteur-physique-presentation-p3"			: "En plus du moteur physique, nous nous sommes occupés de l'affichage: tout d'abord en 2D sur les premiers prototypes, puis en 3D, avec les bibliothèques GLM, GLEW et GLFW. Pour l'affichage de l'interface, nous nous sommes servis de la bibliothèque ImGui. Enfin, nous avons implémenté un Entity Component System (ou ECS) afin de manipuler plus facilement tout les aspects du programme.",
				"moteur-physique-img1-desc" 				: "L'écran de base de l'application",
				"moteur-physique-img2-desc" 				: "Un rigidbody simple avec ses composants",
				"moteur-physique-img3-desc" 				: "Un rigibody soumis à la gravité",
				"moteur-physique-img4-desc" 				: "Les informations de collision de deux rigidbody",
				"moteur-physique-img5-desc" 				: "Deux rigidbody ayant une liaison ressort",
				"moteur-physique-tR-p1" 					: "Le projet a été divisé en quatre phases, afin de suivre ce qui nous était enseigné en cours au même moment. À l'issue de ces quatre phases, nous devions faire une démo utilisant les nouvelles fonctionnalités. Durant la phase 1, nous devions construire un moteur élémentaire de gestion de particules. Durant la phase 2, nous devions rajouter les notions de forces et de contraintes (la gravité, une liaison ressort...). La phase 3 se concentrait sur l'implémentation des rigidbody et de la physique rotationnelle. Durant la phase 4, nous devions implémenter un système de détection de collision.",
				"moteur-physique-tR-p2" 					: "Durant toutes ces phases, je me suis concentré sur l'implémentation des calculs de physique et la façon dont ils fonctionnaient entre eux. J'ai aussi fait beaucoup de debug. Sur la dernière phase, je me suis occupé de la détection de collision, avec la broad phase et la narrow phase.",
				"moteur-physique-dXP-p1" 					: "J'ai apprécié ce projet, j'ai pu apprendre énormément de choses sur le fonctionnement d'un moteur physique, et d'un moteur de jeu en général. J'aurais aimé aller plus loin, mais la taille restreinte de l'équipe et la durée du trimestre m'en ont empêché.",
				"moteur-physique-dXP-p2" 					: "Contrairement à la plupart des autres projets à l'UQAC, nous n'avons pas utilisé la méthode Scrum sur ce projet, et nous sommes répartis les tâches de manière plus informelle. J'ai pu constater que même avec une petite équipe et un faible nombre de tâches, la communication et la répartition du travail se faisait moins bien. Les mêlées quotidiennes nous auraient particulièrement aidées, car certains problèmes se sont avérés plus complexes que prévu, et nous aurions pu revoir nos priorités journalièrement."
			}
		},
		"en": {
			"strings": {
				"a-propos"									: "About",
				"jeux"										: "Games",
				"projets-divers"							: "Miscellaneous projects",
				"contact"									: "Contact",
				"bonjour"									: "Hello!",
				"a-propos-p1"								: "I am <lead class=\"h2\">Oscar Trosseau</lead>, <strong>a French student in engineering school</strong> (equivalent to a Master of Science) doing a double degree in <strong>computer science for video games</strong>.",
				"a-propos-p2"								: "I wish to continue in this field that I am <strong>passionate</strong> about, and that is why I am looking to do my <strong>end-of-studies internship</strong> in the video game industry, for a period of <strong>20 to 24 weeks</strong>.",
				"me-contacter"								: "<i class=\"fas fa-paper-plane\"></i> Contact me",
				"telecharger-cv"							: "<i class=\"fas fa-file-download\"></i> Download my resume",
				"troubatechno-titre-carousel"				: "Troubatechno: Sauveteur de la House",
				"troubatechno-description-carousel"			: "Save the world in this musical adventure game, made during my master's degree in Computer Science at the Université du Québec à Chicoutimi.",
				"accedez-page"								: "Visit the page",
				"CTK-titre-carousel"						: "Crush the King",
				"CTK-description-carousel"					: "Made during the Winter Wonderjam 2021, this arcade game pits two players against each other in a duel mixing tetris and platformer.",
				"space-escaper-titre-carousel"				: "Space Escapers",
				"space-escaper-description-carousel"		: "Use the complementary skills of two characters to escape from a sinking spaceship. Game made during the Global Game Jam 2020.",
				"daltonizator-titre-carousel"				: "Daltonizator",
				"daltonizator-description-carousel"			: "Realized within the course of CAI at the National Engineering School of Brest, Daltonizator is an android application whose goal is to simulate the vision of a color blind person.",
				"projet-labo-titre-carousel"				: "Project in laboratory",
				"projet-labo-description-carousel"			: "A project that was carried out under the supervision of a teacher-researcher during 4 months at the European Center of Virtual Reality in Brest. It allowed me to work on motion capture, animation, virtual reality, motion recognition and artificial intelligence.",
				"ia-titre-carousel"							: "Artificial intelligence",
				"ia-description-carousel"					: "Various projects carried out at the Université du Québec à Chicoutimi, dealing with AI.",
				"mon-profil-github"							: "My Github profile",
				"CTK-titre"									: "Crush The King",
				"CTK-img1-desc"								: "The title screen",
				"CTK-img2-desc"								: "A player...",
				"CTK-img3-desc"								: "... against another.",
				"CTK-img4-desc"								: "A view of the game",
				"CTK-presentation-p1"						: "<strong>Crush The King</strong> is a game made during the Winter WonderJam 2021, in which two players compete to make the best score. The first one controls a King, who will have to survive as long as possible and climb as high as possible. The second player will control Tetris-like blocks, and will have to crush the other player. But be careful, because some special blocks will spice up the game...",
				"CTK-presentation-p2"						: "The game was made with the following style constraints: Platformer, Arcade and Tabletop.",
				"voir-sur-itchio"							: "<i class=\"fab fa-itch-io\"></i> See on itch.io",
				"voir-sur-github"							: "<i class=\"fab fa-github\"></i> See on github",
				"taches-realisees"							: "Tasks performed",
				"CTK-tR-p1"									: "During the game jam, I had to take care of the interface, animations and the scoring system. One of the big difficulties was to manage the layout of the interface so that it remained coherent on different screen resolutions. Moreover, the interface had to be animated according to the player's actions, and here again, we had to be careful with the different resolutions.",
				"CTK-tR-p2"									: "Having got free assets from itchio, we were able to quickly get a good visual and animations. Finally, the scoring system had to be adjusted between the two types of gameplay so that the scores are equivalent.",
				"retour-dXP"								: "Experience feedback",
				"CTK-retour-dXp"							: "This game jam was a good training on Unity, and allowed me to learn a lot of things from my friends. Nevertheless, it took place remotely due to the covid, and the communication in the team was affected. It allowed me to become aware of the value of discussions and human contact during the different phases of a project, especially with a medium-sized team.",
				"fiche-technique"							: "Information sheet",
				"outils"									: "<i class=\"fas fa-tools\"></i> Tools",
				"equipe"									: "<i class=\"fas fa-users\"></i> Team",
				"annee"										: "<i class=\"far fa-calendar-alt\"></i> Year",
				"dalto-titre"								: "Daltonizator",
				"dalto-img1-desc"							: "The home screen of the application",
				"dalto-img2-desc"							: "The different steps to use the application.",
				"dalto-presentation-p1"						: "<strong>Daltonizator</strong> is an android application realized in the course of Interactive Applications Design at ENIB. Its goal is to quickly simulate the vision of a color blind person.",
				"dalto-presentation-p2"						: "In this project, we had to implement the concepts discussed during the course on android development. In addition, we had as a theme the <a href=\"https://www.un.org/sustainabledevelopment/sustainable-development-goals/\">goals of sustainable development</a>. So, with my team, we decided to look at goal #10, which is reducing inequality.",
				"dalto-presentation-p3"						: "We realized this project with the objective of making it easy for any developer to quickly test the accessibility of their application or website.",
				"dalto-tR-p1"								: "As the project was developed in a short time and in a team of 2, I was able to work on all parts of the application.",
				"dalto-tR-p2"								: "We were able to progress quickly on the realization of the application, with the different views. The core of the project was the image manipulation, and we had to search for a long time before finding the right way to transform the colors of the images. We finally used color transformation matrices, normally intended for image editing software like Photoshop or Gimp.",
				"dalto-retour-dXp"							: "This project allowed me to familiarize myself with Android Studio, and to learn the basics of mobile development. Moreover, it made me aware of the issues related to color blindness. I became aware of the importance of color choices in the construction of a website or a game, and of the need for good contrasts. Paying attention to these design elements is a good practice, which is not only useful for color blind people.",
				"ia-titre"									: "Artificial Intelligence",
				"ia-presentation-p1"						: "I am very interested in the <strong>field of artificial intelligence</strong>, and I took several courses dealing with the subject. The first one focused on general artificial intelligence problems, and the second one dealt with problems specific to video games. These courses worked with a group project system, so it allowed me to implement concretely what I learned there.",
				"ia-cours-ia"								: "IA Course",
				"ia-cours-ia-p1"							: "In this course, realized at UQAC and supervised by C. Cousyn, three small projects allowed to implement the different notions discussed in the course. One of the central notions was the agent concept, but other notions such as expert systems were also addressed.",
				"ia-cours-ia-p2"							: "The goal of this project was to create a vacuum agent, which would automatically move to clean up dust. This would be done in a grid, with each square representing a room. Dust or jewels could appear asynchronously on the grid, and the agent would have to react accordingly: suck up the dust, retrieve the jewels. He also had to do this while minimizing his movements.",
				"ia-cours-ia-p3"							: "This project was based on the notions of a \"goal-based\" agent, as well as a BDI system, \"Beliefs-Desires-Intentions\". Finally, it was also based on non-informed exploration algorithms.",
				"ia-cours-ia-p4"							: "The goal of this project was to create an algorithm capable of solving a sudoku. Here we used what we had learned about constraint satisfaction problems, and by extension informed exploration.",
				"ia-cours-ia-p5"							: "In this project, a logical agent finds himself lost in a forest, represented by a grid of boxes. He has to escape, avoiding a number of obstacles, such as monsters or holes. This agent can move and throw stones to get rid of the monsters.",
				"ia-cours-ia-p6"							: "Once again, we use agent modeling, but with a logical formalism similar to that of expert systems. Moreover, probabilistic notions are integrated in order to calculate the risks of a specific action.",
				"ia-cours-ia-p7"							: "At the end of the session, we were asked to carry out a project, using the AI technology of our choice, to solve a problem.",
				"ia-cours-ia-p8"							: "In our group, we were all French, and we realized that we had a lot of difficulties to recognize the car brands in Quebec. So we decided to create an application that would allow us to identify the brand of a car from a picture.",
				"ia-cours-ia-p9"							: "For this, we used machine learning concepts, and implemented a convolutional neural network on Google Collaboratory with good results.",
				"ia-cours-ia-agent-aspi"					: "Vacuum agent",
				"ia-img1-desc"								: "A view of the vacuum agent project",
				"ia-img2-desc"								: "A view of the sudoku solver project",
				"ia-img3-desc"								: "A view of the logical agent project",
				"ia-img4-desc"								: "A view of the session project",
				"ia-cours-ia-sudoku"						: "Solveur de Sudoku",
				"ia-cours-ia-agent-logique"					: "Logical agent",
				"ia-cours-projet-session"					: "Session project",
				"ia-cours-iaJV"								: "AI for Video Games Course",
				"ia-cours-iaJV-p1"							: "This course, also realized at UQAC, supervised by A. Bouzane, approaches the subject of artificial intelligence by concentrating on its use in video games. The book \"Programming Game AI by Example\" by M. Buckland was used as a support.",
				"ia-cours-iaJV-p2"							: "We first worked on the implementation of the finite state machine of NPC agents, using a high-level message-based communication system.",
				"ia-cours-iaJV-p3"							: "Afterwards, we worked on the programming of emergent behavior, with for example flocking algorithms.",
				"ia-cours-iaJV-p4"							: "Finally, we had a session project that required us to reuse everything we had learned in class.",
				"ia-cours-iaJV-p5"							: "We had to adapt the source code of a game from Mr. Buckland's book, called \"Raven\". It is a Quake or Unreal Tournament type game, in which agents kill each other. They can choose from a variety of weapons, and can collect ammunition and healing kits.",
				"ia-cours-iaJV-p6"							: "We were asked to add rules for the choice of certain actions, to implement a fuzzy behavior, to add a system of teams and orders given by the player. Finally, we also had to add a learning agent, using machine learning.",
				"ia-cours-iaJV-p7"							: "This project allowed me to learn a lot about artificial intelligence, and its implementation in a game.",
				"ia-ds-le-1er-cours"						: "in the first course:",
				"ia-ds-le-2nd-cours"						: "and in the second course:",
				"projet-lab-titre"							: "Project in laboratory",
				"projet-lab-img1-desc"						: "The CERV",
				"projet-lab-img2-desc"						: "The Perception Neuron suit.",
				"projet-lab-img3-desc"						: "The case containing the VR equipment",
				"projet-lab-img4-desc"						: "A view of the application on Unity",
				"projet-lab-presentation-p1"				: "<strong>This laboratory project</strong> was carried out in collaboration with the Ecole Nationale d'Ingénieurs de Brest at the Centre Européen de la Réalité Virtuelle. Supervised by two teachers-researchers, the subject was: \"use of a mobile device for motion capture and manipulation of a force feedback arm\". It took place over 4 months between September and December 2020.",
				"projet-lab-presentation-p2"				: "Due to the confinement during this period, the objectives evolved. The final project consisted in implementing gesture recognition and activity analysis algorithms from 3D skeleton data and integrating them into a virtual reality environment under Unity.",
				"projet-lab-presentation-p3"				: "To carry out this task, me and my teammate had to rely on scientific articles and compare different algorithms and configurations. This allowed us to approach many fields, to use technologies for the first time, and all this thanks to the trust that our supervisors gave us; <a href=\"https://www.enib.fr/~nedelec/\">A. Nedelec</a> and <a href=\"https://www.enib.fr/~querrec/\">R. Querrec</a>",
				"voir-doc"									: "<i class=\"fas fa-book\"></i> See the documentation",
				"projet-lab-mocap"							: "Motion capture",
				"projet-lab-mocap-p1"						: "The CERV had several motion capture suits at its disposal, with different technologies. Our supervisors suggested that we use the Perception Neuron suit, from the company Noitom, which they had just received. It is a wearable, adaptive and inexpensive suit that works with magnetic sensors. In addition, Noitom has developed modules so that it can work in real time with different software, be it Unity, Unreal Engine or modeling software such as Blender or Maya.",
				"projet-lab-mocap-p2"						: "We were therefore able to link the outfit with an application, made on Unity, which allowed the management of this data.",
				"projet-lab-rv"								: "Virtual Reality",
				"projet-lab-rv-p1"							: "Once again, the CERV gave us access to their equipment. We were able to work with an HTC Vive, in a room that had been specially made available to us.",
				"projet-lab-rv-p2"							: "We then had to synchronize the helmet and the outfit on Unity, which gave us a very good basis to work on the core project.",
				"projet-lab-reco-mvt"						: "Motion recognition",
				"projet-lab-reco-mvt-p1"					: "The part that required the most time on this project was the motion recognition. Indeed, it is a research topic that still require a lot of work. We used two different approaches: the study of variations, then machine learning.",
				"projet-lab-reco-mvt-p2"					: "The first approach is divided in two steps: first, position recognition, then motion recognition in a position stream. This approach, rather simplistic, does not give very good results.",
				"projet-lab-reco-mvt-p3"					: "The second approach, machine learning, gave much better results, while offering shorter calculation times.",
				"projet-lab-reco-mvt-p4"					: "In both cases, we relied on scientific articles, and integrated everything into a movement training and recognition application.",
				"troubatechno-titre1"						: "Troubatechno",
				"troubatechno-titre2"						: "Sauveteur de la House",
				"troubatechno-img1-desc"					: "The Traveller",
				"troubatechno-img2-desc"					: "The traveler's movements",
				"troubatechno-img3-desc"					: "Interactions with objects",
				"troubatechno-img4-desc"					: "The rhythm game",
				"troubatechno-img5-desc"					: "A view of the project in Unreal",
				"troubatechno-presentation-p1"				: "Produced as part of the 8INF962 \"Laboratoire de jeux vidéo\" course at UQAC, Troubatechno allows you to play as a time traveler famous throughout the galaxy, guilty of tax evasion.",
				"troubatechno-presentation-p2"				: "Now on the run, you take refuge on an almost uninhabited planet... If not by an angry god! You'll have to figure out how to defeat him by traveling through time. Will you use your Spacio-lute to calm him down or destroy him?",
				"troubatechno-presentation-p3"				: "To carry out your mission, you will have to:",
				"troubatechno-presentation-liste"			: "<li>Travel in time</li><li>Fight the god's minions</li><li>Dodge his devastating attacks</li><li>Find his weaknesses</li><li>... and play music!</li>",
				"troubatechno-tR-p1"						: "For this project, I had to set up the player's movements and their animations. I then set up a system of interactions with different objects and visual feedback.",
				"troubatechno-tR-p2"						: "I also did some level design by taking care of one of the areas of the game. Finally, I made the whole rhythm game, whether it is the interface, the animations or the synchronization of the game with the music.",
				"troubatechno-retour-dXP-p1"				: "This project allowed me to learn a lot about video game development. I was able to put into practice what I was taught about agile methods. I was also able to learn how to use Unreal Engine, using both C++ and blueprints.",
				"troubatechno-retour-dXP-p2"				: "More than purely technical skills, this project also allowed me to work on animation, sound design, level design and balancing. The small size of the team allowed me to be involved in at least a little bit of each aspect of development, and it was an exciting experience.",
				"space-escaper-titre"						: "Space Escapers",
				"space-escaper-img1-desc"					: "The title screen",
				"space-escaper-img2-desc"					: "The introduction",
				"space-escaper-img3-desc"					: "The scientist",
				"space-escaper-img4-desc"					: "The mechanic",
				"space-escaper-img5-desc"					: "The interaction system",
				"space-escaper-img6-desc"					: "One of the puzzles",
				"space-escaper-presentation-p1"				: "<strong>Space Escapers</strong> is a game made during the Global Game Jam 2020, in which you must help two occupants of a sinking spaceship to escape. Both the mechanic and the scientist have specific skills, and they will have to work together if they want to succeed! A valuable tool is at their disposal, however, which allows them to switch positions. Solve the puzzles that block their way out!",
				"space-escaper-presentation-p2"				: "This year's theme was \"Repair\".",
				"space-escaper-tR-p1"						: "During the game jam, I had the task to create the interaction system with the environment. I also worked on different elements of the game, such as teleporters or doors. Finally, I also realized one of the puzzles.",
				"space-escaper-retour-dXP-p1"				: "It was my first Game Jam, and it was very enriching and fun. It allowed me to discover several tools on Unity, and to learn to work under pressure.",
				"space-escaper-retour-dXP-p2"				: "It also made me realize that I really wanted to continue in the field of video games. Indeed, even more than the pleasure of solving a problem, it is the creativity that I could deploy that really motivates me in the computer science field.",
				"voir-sur-GGJ"								: "See the Global Game Jam website",
				"ratvage-titre-carousel"					: "Ratvage",
				"ratvage-description-carousel" 				: "Grow your horde of rats and take control of a pirate island.",
				"ratvage-titre" 							: "Ratvage",
				"ratvage-img1-desc" 						: "The rat",
				"ratvage-img2-desc" 						: "Somme cheese",
				"ratvage-img3-desc" 						: "A pirate",
				"ratvage-img4-desc" 						: "Garbage",
				"ratvage-img5-desc" 						: "The view from one of the levels I developed",
				"ratvage-img6-desc" 						: "The horde following the main rat",
				"ratvage-img7-desc" 						: "The level selection menu",
				"ratvage-presentation-p1"					: "In Ratvage, you play as a rat disillusioned with life on the old continent and looking to find his place in the new world. He will be <strong>king</strong>, no less!",
				"ratvage-presentation-p2"					: "To achieve his ambitions, he can count on his faithful horde of rats. They will grow with every cheese they eat. And he'll need them, because fierce pirates live his soon-to-be kingdom, and only numbers can defeat them.",
				"ratvage-presentation-p3"					: "Be careful, because he does not have absolute control over the horde; all rats like food, and are even more attracted to garbage.",
				"ratvage-presentation-p4"					: "If you help him overcome all the dangers, then you will have the chance to get the Grail of Cheeses, and thus establish your control over the region.",
				"ratvage-presentation-p5"					: "This game was created has part of the course 8INF960 \"Principes de conception et de développement de jeux vidéo\" of UQAC.",
				"ratvage-tR-p1" 							: "In this project, I was the only one who had experience in video game development, either in gamejams or with UQAC courses. This allowed me to have a more important advisory and supervisory role than in my previous projects. I was among others things scrum-master.",
				"ratvage-tR-p2" 							: "Otherwise, I was able to confront myself with aspects of video game development that I hadn't tackled before: I did level design, on 3 different levels. I was also able to do some AI, by taking care of the behavior of the rat horde: I implemented a <a href=\"https://github.com/SebLague/Boids\" target=\"_blank\">flocking system</a> developed by Seb Lague, which I modified according to the needs of the project.",
				"ratvage-tR-p3"  							: "I also took care of the garbage object, and how it interacts with the horde. I implemented a level choice menu, which I wanted to make very dynamic and fun to watch. Finally, I spent a lot of time polishing and bugfixing.",
				"ratvage-retour-dXP-p1" 					: "I learned a lot during this project, and I feel that I have evolved since my first project in the Video Game Lab course at UQAC. I was able to approach new domains, such as level design, AI, animation.",
				"ratvage-retour-dXP-p2" 					: "Working with my classmates was a pleasure, the communication was good and we were moving forward consistently. It is even better considering that it was the first experience my classmates had with this kind of project. I am very happy with the final result, even if the game is short, it does not give the impression of having been rushed, thanks in particular to the feedbacks and the polish.",
				"koompsC-titre-carousel" 					: "Koomp’s Ca$hette",
				"koompsC-description-carousel" 				: "Collect the most coins or hunt your friends in this network hide-and-seek game, created as part of the course \"Programmation réseau dans les jeux vidéos\" at UQAC.",
				"koompsC-titre"			 					: "Koomp’s Ca$hette",
				"koompsC-img1-desc"		 					: "The Cosht",
				"koompsC-img2-desc"		 					: "A Koomps",
				"koompsC-img3-desc"		 					: "A Koomps gets chased",
				"koompsC-img4-desc"		 					: "The map of the game",
				"koompsC-img5-desc"		 					: "A coin to collect",
				"koompsC-img6-desc"		 					: "The Cosht's point of view",
				"koompsC-img7-desc"		 					: "The end of game screen",
				"koompsC-presentation-p1" 					: "Koomp's Ca$hette is a hide-and-seek game with a cartoon design where several players will hide from a last player, while searching for coins scattered throughout the level. The goal is to be the player with the most coins at the end of a given time.",
				"koompsC-presentation-p2" 					: "The players playing the Koomps (i.e. the prey) can move, hide, and collect coins. The player playing the Cosht (i.e. the hunter) can move, and shoot a laser beam on the prey. This removes coins from them, and teleports them away from him.",
				"koompsC-presentation-p3" 					: "This project was realized during the course \"Programmation réseau dans les jeux vidéos\" at UQAC.",
				"koompsC-tR-p1" 							: "In this project, we started with a first simple prototype of the game, without networking. I took care of the pieces, and their spawning on the map. My classmates added the Koomps and the interface.",
				"koompsC-tR-p2" 							: "After that, I took care of setting up the networking on this prototype, while my colleagues kept on developing it. I also added a basic menu, in order to be able to connect to different addresses. As my classmates advanced on their parts, I was able to set them up for networking too, notably the Cohst.",
				"koompsC-tR-p3" 							: "We had an almost completed prototype, so I finished making the game loop (the spawning at a random point of the players, the countdown clock, the end screen...). In the little I had left, I fixed some bugs and polished the game.",
				"koompsC-retour-dXP-p1" 					: "I had already studied networking, but in a rather superficial way. The \"Programmation réseau dans les jeux vidéos\" course allowed me to deepen and to put into practice my knowledge. At first in a general way (we had to create libraries allowing to network, with Socket/Serialisation/Replication), and then more precisely with the solution offered by Unity.",
				"koompsC-retour-dXP-p2" 					: "And despite the moderate scale of this project, I learned a lot about network problematics in video games. Furthermore, by playing with my classmates, I realized that it was easier to make multiplayer games fun than singleplayer game. Indeed, even with its simple gameplay the game is fun.",
				"moteur-physique-titre-carousel" 			: "Simple physical engine",
				"moteur-physique-description-carousel" 		: "A physics engine made during the \"Mathématiques et Physique pour le jeu Vidéo\" course at UQAC, using OpenGL and ImGui for the rendering.",
				"moteur-physique-titre"						: "Physical Engine",
				"moteur-physique-presentation-p1"			: "During the course \"Mathematics and Physics for video games\" at UQAC, I programmed with two classmates a rudimentary physical engine. We relied in particular on two books, \"Game Physics Engine Development\" by I. Millington and \"Real time collision detection\" by C. Ericson.",
				"moteur-physique-presentation-p2"			: "We first developed a particle system, with a physics engine that could simulate several types of forces (the gravity, an elastic binding, the buoyancy...) and manage collisions. In a second time, we developed a rigidbody system: unlike particles which have a null volume, the rigidbodies have a shape, a volume and thus also a mass. Moreover, rotations must be taken into account. Finally, we programmed a collision detection system for the rigidbodies, but without the resolution which was out of the course.",
				"moteur-physique-presentation-p3"			: "We first developed a particle system, with a physics engine that could simulate several types of forces (gravity, elastic bond, buoyancy...) and manage collisions. In a second time, we developed a rigidbody system: unlike particles which have a null volume, rigidbodies have a shape, a volume and thus also a mass. Moreover, rotations must be taken into account. Finally, we programmed a collision detection system for these rigid bodies, without the resolution which was out of the course.",
				"moteur-physique-img1-desc" 				: "The initial screen of the application",
				"moteur-physique-img2-desc" 				: "A simple rigidbody with its components",
				"moteur-physique-img3-desc" 				: "A rigibody affected by gravity",
				"moteur-physique-img4-desc" 				: "The informations about a collision between two rigidbodies",
				"moteur-physique-img5-desc" 				: "Two rigidbodies with a spring connection",
				"moteur-physique-tR-p1" 					: "The project was divided into four phases, in order to use what was taught in class at the same time. At the end of each phase, we had to make a demo using the new features. In phase 1, we had to build a basic particle management engine. During the second phase, we had to add notions of forces and constraints (like gravity, a spring link...). The 3rd phase focused on the implementation of rigibodies and rotational physics. In phase 4, we had to implement a collision detection system.",
				"moteur-physique-tR-p2" 					: "During all these phases, I focused on the implementation of the physics calculations and how they interacted together. I also worked a lot on  debugging. On the last phase, I took care of the collision detection, with the broad and narrow phases.",
				"moteur-physique-dXP-p1" 					: "I enjoyed this project, I was able to learn a lot about how a physics engine and game engines work. I would have liked to go further, but the small size of our team and the length of the semester prevented me from doing so.",
				"moteur-physique-dXP-p2" 					: "Contrary to most of the other projects at UQAC, we didn't use the Scrum method on this project, and we distributed the tasks in a more informal way. I noticed that even with a small team and a low number of tasks, the communication and the work distribution was less efficient. The daily scrum would have been especially helpful, as some issues turned out to be more challenging than expected, and we could have reviewed our priorities daily."
			}
		}
	}
}