{
	"languages": {
		"fr": {
			"strings": {
				"a-propos"									: "A propos",
				"jeux"										: "Jeux",
				"projets-divers"							: "Projets divers",
				"contact"									: "Contact",
				"bonjour"									: "Bonjour!",
				"a-propos-p1"								: "Je suis <lead class=\"h2\">Oscar Trosseau</lead>, <strong>étudiant en école d'ingénieur</strong> faisant un double diplôme <strong>d'informatique pour le jeu vidéo</strong>.",
				"a-propos-p2"								: "Je souhaite continuer dans cette voie qui me <strong>passionne</strong>, et c'est pour cela que je suis à la recherche d'un <strong>stage</strong> dans le domaine du jeu vidéo, pour une période de <strong>20 à 24 semaines</strong> à partir de <strong>décembre 2022</strong>.",
				"me-contacter"								: "<i class=\"fas fa-paper-plane\"></i> Me contacter",
				"telecharger-cv"							: "<i class=\"fas fa-file-download\"></i> Télécharger mon CV",
				"troubatechno-titre-carousel"				: "Troubatechno: Sauveteur de la House",
				"troubatechno-description-carousel"			: "Sauvez le monde dans ce jeu d'aventure musical, réalisé durant mon master en Informatique à l'Université du Québec à Chicoutimi.",
				"accedez-page"								: "Accédez à la page",
				"CTK-titre-carousel"						: "Crush the King",
				"CTK-description-carousel"					: "Réalisé durant la Wonderjam d'hiver 2021, ce jeu d'arcade oppose deux joueurs dans un duel mêlant tetris et platformer.",
				"space-escaper-titre-carousel"				: "Space Escapers",
				"space-escaper-description-carousel"		: "Utilisez les compétences complémentaires de deux personnages pour vous échapper d'un vaisseau spatial en perdition. Jeu réalisé durant la Global Game Jam 2020.",
				"daltonizator-titre-carousel"				: "Daltonizator",
				"daltonizator-description-carousel"			: "Réalisée dans le cadre du cours de CAI à l'Ecole Nationale d'Ingénieurs de Brest, Daltonizator est une application android ayant pour but de simuler la vision d'un daltonien.",
				"projet-labo-titre-carousel"				: "Projet en laboratoire",
				"projet-labo-description-carousel"			: "Un projet ayant été réalisé sous la supervision d'un enseignant-chercheur durant 4 mois au Centre Européen de la Réalité Virtuelle à Brest. Il m'a permis de travailler sur de la capture de mouvements, de l'animation, de la réalité virtuelle, de la reconnaissance de mouvement et de l'intelligence artificielle.",
				"ia-titre-carousel"							: "Intelligence artificielle",
				"ia-description-carousel"					: "Divers projets réalisés à l'Université du Québec à Chicoutimi, portants sur l'IA.",
				"mon-profil-github"							: "Mon profil Github",
				"CTK-titre"									: "Crush The King",
				"CTK-img1-desc"								: "L'écran titre",
				"CTK-img2-desc"								: "Un joueur...",
				"CTK-img3-desc"								: "... contre un autre.",
				"CTK-img4-desc"								: "Une vue du jeu",
				"CTK-presentation-p1"						: "<strong>Crush The King</strong> est un jeu réalisé durant la WonderJam d'Hiver 2021, dans lequel deux joueurs s'affrontent pour faire le meilleur score. Le premier contrôle un Roi, qui devra survivre le plus longtemps possible et monter le plus haut. Le second contrôlera des blocs à la manière de Tetris, et devra écraser l'autre joueur. Mais attention, car certains blocs spéciaux viendront pimenter la partie...",
				"CTK-presentation-p2"						: "Le jeu a été réalisé avec les contraintes de style suivantes: Platformer, Arcade et Tabletop.",
				"voir-sur-itchio"							: "<i class=\"fab fa-itch-io\"></i> Voir sur itch.io",
				"voir-sur-github"							: "<i class=\"fab fa-github\"></i> Voir sur github",
				"taches-realisees"							: "Taches réalisées",
				"CTK-tR"									: "Durant la game jam, j'ai eu pour tache de m'occuper de l'interface, d'animations ainsi que du système de score.",
				"retour-dXP"								: "Retour d'expérience",
				"CTK-retour-dXp"							: "Cette game jam à constitué un bon entraînement sur Unity, et m'a permise d'apprendre de nombreuses choses au contact de mes camarades. Néanmoins, elle s'est déroulée à distance à cause du covid, et la communication dans l'équipe s'en est retrouvée affectée. Cela m'a permis de prendre toute la conscience de la valeur des discussions en présence et du contact humain lors des différentes phases d'un projet, surtout avec une équipe de taille moyenne.",
				"fiche-technique"							: "Fiche technique",
				"outils"									: "<i class=\"fas fa-tools\"></i> Outils",
				"equipe"									: "<i class=\"fas fa-users\"></i> Equipe",
				"annee"										: "<i class=\"far fa-calendar-alt\"></i> Année",
				"dalto-titre"								: "Daltonizator",
				"dalto-img1-desc"							: "L'écran d'acceuil de l'application",
				"dalto-img2-desc"							: "Les différentes étapes permettant d'utiliser l'application.",
				"dalto-presentation-p1"						: "<strong>Daltonizator</strong> est une application android réalisée dans le cadre du cours de Conception d'Applications Interactives à l'ENIB. Elle à pour but de permettre de simuler rapidement la vision d'un daltonien.",
				"dalto-presentation-p2"						: "Dans le cadre de ce projet, nous devions mettre en place les notions abordées lors du cours sur le développement android. De plus, nous avions comme thème les <a href=\"https://www.un.org/sustainabledevelopment/fr/objectifs-de-developpement-durable/\">objectifs du développement durable</a>. Avec mon équipe, nous avons donc décidé de nous pencher sur l'objectif n°10, à savoir la réduction des inégalités.",
				"dalto-presentation-p3"						: "Nous avons réalisé ce projet avec en tête l'idée que tout développeur pourrait facilement et rapidement tester l'accessibilité de son application ou de son site.",
				"dalto-tR"									: "Le projet ayant été développé en un temps assez court et dans une équipe de 2, j'ai pu travailler sur toutes les parties de l'application.",
				"dalto-retour-dXp"							: "Ce projet m'a permis de me familiariser avec Android Studio, et d'apprendre les bases du développement mobile. Qui plus est, cela a pu me sensibiliser aux problématiques liées au daltonisme.",
				"ia-titre"									: "Intelligence Artificielle",
				"ia-presentation-p1"						: "<strong>Le domaine de l'intelligence artificielle</strong> m'intéresse fortement, aussi ai-je suivi plusieurs cours traitants du sujet. Le premier se concentrait sur des problèmes d'intelligence artificielle généraux, et le second traitait de problèmes spécifiques aux jeux vidéo. Ces cours fonctionnaient avec un système de projet en groupe, aussi cela m'a permis de mettre en oeuvre concrètement ce que j'y ai appris.",
				"ia-presentation-p2"						: "Certains de ces projets ont été réalisés en utilisant la fonction Collaborate d'Unity, ou le Colab de Visual Studio, aussi je ne peux pas partager le dépôt de travail.",
				"ia-cours-ia"								: "Cours IA",
				"ia-cours-ia-p1"							: "Dans ce cours, réalisé à l'UQAC et encadré par C. Cousyn, trois petits projets ont permis de mettre en place les différentes notions abordées en cours. Une des notions centrales était le concept d'agent, mais d'autres notions tel que les systèmes-experts ont été abordées.",
				"ia-cours-ia-p2"							: "Le but de ce projet était de créer un agent aspirateur, qui se déplacerait automatiquement pour nettoyer la poussière. Cela se ferait dans un quadrillage, avec chaque case représentant une pièce. Des poussières ou des bijoux pouvaient apparaitre de façon asynchrone sur le quadrillage, et l'agent devait réagir en conséquence: aspirer la poussière, récupérer les bijoux. Il devait aussi le faire en minimisant ses déplacements.",
				"ia-cours-ia-p3"							: "Ce projet s'appuyait sur les notions d'agent de type \"basé sur des buts\", ainsi qu'un système de BDI, \"Beliefs-Desires-Intentions\". Enfin, il s'appuyait aussi sur des algorithmes d'exploration non-informée.",
				"ia-cours-ia-p4"							: "Ce projet avait pour but de créer un algorithme capable de résoudre un sudoku. Ici on a utilisé ce que nous avions appris sur les problèmes à satisfaction de contrainte, et par extension l'exploration informée.",
				"ia-cours-ia-p5"							: "Dans ce projet, un agent logique se retrouve perdu dans une forêt, représentée par une grille de cases. Il doit s'en échapper, en évitant un certain nombre d'obstacles, tels que des monstres ou des crevasse. Cet agent peut se déplacer et lancer des pierres pour se débarrasser des monstres.",
				"ia-cours-ia-p6"							: "La encore, on utilise la modélisation agent, mais avec un formalisme logique similaire à celui des systèmes experts. De plus, des notions probabilistes sont intégrées afin de calculer les risques de telle ou telle action.",
				"ia-cours-ia-p7"							: "À la fin de la session, il nous était demandé de réaliser un projet, en s'appuyant la technologie d'IA de notre choix, pour répondre à une problématique.",
				"ia-cours-ia-p8"							: "Dans notre groupe, nous n'étions que des français, et nous nous sommes rendu compte que nous avions beaucoup de difficultés à reconnaitre les marques de voiture du Québec. Nous avons donc décidé de mettre en place une application qui permettrait, à partir d'une photo, d'identifier la marque d'une voiture.",
				"ia-cours-ia-p9"							: "Pour cela, nous avons fait appel à des notions d'apprentissage machine, et avons mis en place un réseau de neurones convolutifs sur Google Collaboratory avec des résultats concluants.",
				"ia-cours-ia-agent-aspi"					: "Agent aspirateur",
				"ia-img1-desc"								: "Une vue du projet agent aspirateur",
				"ia-img2-desc"								: "Une vue du projet solveur de sudoku",
				"ia-img3-desc"								: "Une vue du projet agent logique",
				"ia-img4-desc"								: "Une vue du projet de session",
				"ia-cours-ia-sudoku"						: "Solveur de Sudoku",
				"ia-cours-ia-agent-logique"					: "Agent logique",
				"ia-cours-projet-session"					: "Projet de session",
				"ia-cours-iaJV"								: "Cours d'IA pour le Jeu Vidéo",
				"ia-cours-iaJV-p1"							: "Ce cours, réalisé lui aussi à l'UQAC, encadré par A. Bouzane, aborde le sujet de l'intelligence artificielle en se concentrant sur son utilisation dans les jeux vidéo. Pour cela, le livre \"Programming Game AI by Example\" de M. Buckland a servi de support.",
				"ia-cours-iaJV-p2"							: "Nous avons travaillé dans un premier temps à la mise en place de la machine à état fini d'agents PNJ, en utilisant un système de communication à haut niveau à base de messages.",
				"ia-cours-iaJV-p3"							: "Par la suite, nous avons travaillé sur la programmation de comportement émergent, avec par exemple des algorithmes de flocking.",
				"ia-cours-iaJV-p4"							: "Enfin, nous avons eu un projet de session qui demandait de réutiliser tout ce que nous avions appris en cours.",
				"ia-cours-iaJV-p5"							: "Nous avons du adapter le code source d'un jeu du livre de M. Buckland, le jeu \"Raven\". Il s'agit d'un jeu de type Quake ou Unreal Tournament, dans lequel des agents s'entretuent. Ceux-ci peuvent choisir entre une variété d'armes, et peuvent récupérer des munitions et des trousses de soin.",
				"ia-cours-iaJV-p6"							: "Il nous était demandé de rajouter des règles pour le choix de certaines actions, d'implémenter un comportement flou, de rajouter un système d'équipes et d'ordres donnés par le joueur. Enfin, nous devions aussi rajouter un agent apprenant, grace à de l'apprentissage machine.",
				"ia-cours-iaJV-p7"							: "Ce projet m'a permis d'apprendre énormément de choses sur l'intelligence artificielle, et son implémentation dans un jeu.",
				"ia-ds-le-1er-cours"						: "dans le premier cours:",
				"ia-ds-le-2nd-cours"						: "puis dans le second cours:",
				"projet-lab-titre"							: "Projet en laboratoire",
				"projet-lab-img1-desc"						: "Le CERV",
				"projet-lab-img2-desc"						: "La tenue Perception Neuron",
				"projet-lab-img3-desc"						: "La caisse contenant le matériel de VR",
				"projet-lab-img4-desc"						: "Une vue de l'application sur Unity",
				"projet-lab-presentation-p1"				: "<strong>Ce projet en laboratoire</strong> a été réalisé en partenariat avec l'Ecole Nationale d'Ingénieurs de Brest au Centre Européen de la Réalité Virtuelle. Encadré par deux enseignants-chercheurs, le sujet était: \"utilisation d'un dispositif mobile de captation de mouvements et la manipulation d'un bras à retour d'efforts.\". Cela s'est déroulé sur 4 mois entre septembre et décembre 2020.",
				"projet-lab-presentation-p2"				: "Suite au confinement durant cette période, les objectifs ont évolué. Le projet final a consisté à mettre en œuvre des algorithmes de reconnaissance de gestes et d'analyse d'activités à partir de données de squelette 3D et de les intégrer dans un environnement de réalité virtuelle sous Unity.",
				"projet-lab-presentation-p3"				: "Pour mener à bien cette mission, moi et mon binôme avons dû nous appuyer sur des articles scientifiques et comparer différents algorithmes et configuration. Cela nous a permis d'aborder de nombreux domaines, d'utiliser des technologies pour la première fois, et tout cela grace à la confiance que nous ont accordé nos encadrant; <a href=\"https://www.enib.fr/~nedelec/\">A. Nedelec</a> et <a href=\"https://www.enib.fr/~querrec/\">R. Querrec</a>",
				"voir-doc"									: "<i class=\"fas fa-book\"></i> Voir la documentation",
				"projet-lab-mocap"							: "Capture de mouvements",
				"projet-lab-mocap-p1"						: "Le CERV avait à sa disposition plusieurs tenues de Motion Capture, avec des technologies différentes. Nos encadrant nous ont alors proposé d'utiliser la tenue Perception Neuron, de la compagnie Noitom, qu'ils venaient tout juste de recevoir. C'est une tenue portable, adaptative et peu coûteuse, qui fonctionne avec des capteurs magnétiques. De plus, la compagnie Noitom a développé des modules pour qu'elle puisse fonctionner en temps réel avec différents logiciels, que ce soit Unity, Unreal Engine ou des logiciels de modélisation comme Blender ou Maya.",
				"projet-lab-mocap-p2"						: "Nous avons donc pu relier la tenue avec une application, réalisée sur Unity, qui permettait la gestion de ces données.",
				"projet-lab-rv"								: "Réalité Virtuelle",
				"projet-lab-rv-p1"							: "Encore une fois, le CERV nous a permis d'accéder à son matériel. Nous avons donc pu travailler avec un HTC Vive, dans une salle qui avait été mise à notre disposition.",
				"projet-lab-rv-p2"							: "Nous avons ensuite dû synchroniser le casque et la tenue sur Unity, ce qui nous donné une très bonne base pour travailler sur le coeur du projet.",
				"projet-lab-reco-mvt"						: "Reconnaissance de mouvements",
				"projet-lab-reco-mvt-p1"					: "La partie qui a demandé le plus de temps sur ce projet était la reconnaissance de mouvements. En effet, c'est un sujet de recherche qui nécessite encore beaucoup de travail. Nous avons utilisé deux approches différentes: l'étude des variations, puis l'apprentissage machine.",
				"projet-lab-reco-mvt-p2"					: "La première approche se divise en deux étapes: dans un premier temps, de la reconnaissance de position, puis dans un second temps de la reconnaissance de mouvement dans un flux de positions. Cette approche, plutot simpliste, ne donne pas de très bons résultats.",
				"projet-lab-reco-mvt-p3"					: "La seconde approche, l'apprentissage machine, a donné de bien meilleurs résultats, tout en offrant des temps de calculs plus courts.",
				"projet-lab-reco-mvt-p4"					: "Dans les deux cas, nous nous sommes appuyé sur des articles scientifiques, et avons intégré le tout dans une application d'entrainement au mouvement et de reconnaissance de mouvement.",
				"troubatechno-titre1"						: "Troubatechno",
				"troubatechno-titre2"						: "Sauveteur de la House",
				"troubatechno-img1-desc"					: "Le Voyageur",
				"troubatechno-img2-desc"					: "Les déplacements du voyageur",
				"troubatechno-img3-desc"					: "Les interactions avec les objets",
				"troubatechno-img4-desc"					: "Le jeu de rythme",
				"troubatechno-img5-desc"					: "Une vue du projet sous Unreal",
				"troubatechno-presentation-p1"				: "Réalisé dans le cadre du cours 8INF962 \"Laboratoire de jeux vidéo\" de l'UQAC, Troubatechno vous permet d'incarner un voyageur temporel célèbre dans toute la galaxie, coupable d'évasion fiscale.",
				"troubatechno-presentation-p2"				: "Désormais contraint de partir en cavale, vous vous réfugiez sur une planète presque inhabitée... Si ce n'est par un dieu colérique! Vous devrez alors découvrir comment le vaincre en voyageant dans le temps. Utiliserez-vous votre spacio-luth pour le calmer ou le détruire?",
				"troubatechno-presentation-p3"				: "Pour mener à bien votre mission, vous devrez:",
				"troubatechno-presentation-liste"			: "<li>Voyager dans le temps</li><li>Combattre les sbires du dieu</li><li>Esquiver ses attaques dévastatrices</li><li>Trouver ses points faibles</li><li>... et jouer de la musique!</li>",
				"troubatechno-tR-p1"						: "Dans le cadre de ce projet, j'ai dû m'occuper de mettre en place les déplacements du joueur et leurs animations. J'ai ensuite mis en place un système d'interactions avec différents objets et des retour visuels.",
				"troubatechno-tR-p2"						: "J'ai aussi fait du level design en m'occupant d'une des zones du jeu. Enfin, j'ai réalisé tout le jeu de rythme, que ce soit l'interface, les animations ou la synchronisation du jeu avec la musique.",
				"troubatechno-retour-dXP-p1"				: "Ce projet m'a permis d'en apprendre beaucoup sur le développement de jeux vidéo. J'ai pu mettre en pratique ce qui m'a été enseigné sur les méthodes agiles. J'ai aussi pu apprendre à me servir d'Unreal Engine, en me servant à la fois du C++ et des blueprints.",
				"troubatechno-retour-dXP-p2"				: "Plus que des compétences purement techniques, ce projet m'a aussi permis de me pencher sur de l'animation, du sound design, du level design et de l'équilibrage. La taille restreinte de l'équipe m'a permise de me confronter au moins un petit peu à chaque aspects du développement, et cela à été une expérience passionnante.",
				"space-escaper-titre"						: "Space Escapers",
				"space-escaper-img1-desc"					: "L'écran titre",
				"space-escaper-img2-desc"					: "L'introduction",
				"space-escaper-img3-desc"					: "Le scientifique",
				"space-escaper-img4-desc"					: "Le mécanicien",
				"space-escaper-img5-desc"					: "Le système d'interaction",
				"space-escaper-img6-desc"					: "Une des énigmes",
				"space-escaper-presentation-p1"				: "<strong>Space Escapers</strong> est un jeu réalisé durant la Global Game Jam 2020, dans lequel vous devez aider deux occupants d'un vaisseau spatial en perdition à s'échapper. Le mécanicien et le scientifique ont tout deux des compétences spécifiques, et ils devront travailler ensemble s'ils veulent réussir! Ils disposent tout de même d'un outil précieux, qui leur permet d'échanger leurs positions. Résolvez les énigmes qui leur barre le chemin de la sortie!",
				"space-escaper-presentation-p2"				: "Le thème de cette édition était \"Repair\".",
				"space-escaper-tR-p1"						: "Durant la game jam, j'ai eu pour tache de créer le système d'interaction avec l'environnement. Je me suis aussi occupé de différents éléments du jeu, tels que les téléporteurs ou les portes. Enfin, j'ai aussi réalisé une des énigmes.",
				"space-escaper-retour-dXP-p1"				: "C'était ma première Game Jam, et elle à été très enrichissante et ludique. Cela m'a permis de découvrir plusieurs outils sur Unity, et d'apprendre à travailler sous la pression.",
				"voir-sur-GGJ"								: "Voir sur le site de la Global Game Jam"
			}
		},
		"en": {
			"strings": {
				"a-propos"			: "About",
				"jeux"				: "Games",
				"projets-divers"	: "Miscellaneous projects",
				"contact"			: "Contact"
			}
		}
	}
}